app/views/productos/index.html.erb

SELECT "categoria".* FROM "categoria"   ORDER BY nombre
---
			<ul >
				<% Categoria.all.each do |cat| %>