app/views/productos/show.html.erb

SELECT  "categoria".* FROM "categoria"  WHERE "categoria"."id" = $1  ORDER BY nombre LIMIT 1  [["id", 8]]
---
				<li><a href="/">Home</a><span class="divider"></span></li>
				<li><%=link_to Categoria.find(@producto.categoria_id).nombre, productos_path(categoria: @producto.categoria_id) %>

SELECT "pregunta".* FROM "pregunta"  WHERE "pregunta"."producto_id" = $1  [["producto_id", 1]]
---
                            <!--Muestra el mensaje si no hay preguntas-->
                                <% if @producto.preguntas.count == 0 %>