app/controllers/productos_controller.rb

  def index
    if params[:search]
      @producto_a = Producto.search(params[:search]).order("created_at DESC")
    else
      @producto_a = Producto.order("created_at DESC")
    end
    if params[:categoria]
      @producto_a = Producto.where(categoria_id: params[:categoria])
    end
    if params[:orden]
        @producto_a = Producto.order(params[:orden])
---
SELECT "productos".* FROM "productos"  WHERE (descripcion like '%Llama%')  ORDER BY created_at DESC
SELECT "categoria".* FROM "categoria"   ORDER BY nombre
SELECT "productos".* FROM "productos"  WHERE "productos"."categoria" = 1